# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: Ayush Kamleshbhai Patel
#### Student ID: s3891013

Date: XXXX

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used: please include the main libraries you used in your assignment, e.g.,:
* pandas
* re
* numpy


## Introduction
Give general information of this assessment here, e.g., what problems you encounter in integration, general steps and solutions you've taken to integrate the data. 

<span style="color: red"> Note that this is a sample notebook only. You will need to fill in the proper markdown and code blocks. You might also want to make necessary changes to the structure to meet your own needs. Note also that any generic comments written in this notebook are to be removed and replace with your own words.</span>

##  Import libraries

In [1]:
# Code to import libraries as you need in this assessment
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### 1. Examining and loading data
Examine "\<student\_id\>_dataset2.csv" the structure and schema.

In [2]:
# Code to inspect the provided data file
# Couple of notes for all code block in this notebook
## please provide proper comment on your code
## Please re-start and run all cells to make sure codes are runable and include your output in the submission
# -------------------------------------------------------------------------------------------------------------
df = pd.read_csv('s3891013_dataset2.csv')
# # Provide a summary of the data
# print("\nSummary of Data:\n", df.describe(include='all'))

# Check for missing values in the dataset
print("\nMissing Values in Each Column:\n", df.isnull().sum())

# # Display the structure (info) of the data frame
# print("\nInfo of the Data Frame:")
df['Type'].value_counts()

Missing Values in Each Column:
 Monthly Payment                  0
Closing                          0
Organisation                   486
Location                         0
Category                         0
Full-Time Equivalent (FTE)       0
Opening                          0
Job Title                        0
Type                          1420
dtype: int64

Type
Permanent              3040
Fixed Term Contract     540
Name: count, dtype: int64

In [3]:
df

,Monthly Payment,Closing,Organisation,Location,Category,Full-Time Equivalent (FTE),Opening,Job Title,Type
0,1200.00,2012-12-27 12:00:00,Protocol Education,UK,Education,0.8,2012-11-27 12:00:00,Higher Level Teaching Assistant (HLTA),NaN
1,3125.00,2013-08-25 15:00:00,Cordius Ltd,UK,Information Technology,1.0,2013-06-26 15:00:00,Software Developers / Software Architects Not...,Permanent
2,4333.33,2013-01-16 15:00:00,Understanding Recruitment,Walton-On-Thames,Information Technology,1.0,2012-10-18 15:00:00,Senior BI Consultant (Cognos),Permanent
3,3750.00,2013-02-13 15:00:00,Wallace Hind Selection,UK,Sales,1.0,2012-12-15 15:00:00,"Technical Sales Manager, Pigments Fillers to S...",NaN
4,2916.67,2013-01-12 12:00:00,Greenhill Group Ltd,Eastern England,Sales,1.0,2012-12-29 12:00:00,Channel Account Manager Software,NaN
...,...,...,...,...,...,...,...,...,...
4995,5833.33,2013-03-31 00:00:00,Jonathan Lee Recruitment Ltd,London,Finance,1.0,2013-01-30 00:00:00,Head of Regulatory Policy,Permanent
4996,5000.00,2012-08-27 12:00:00,Impact 360,Berkshire,Information Technology,1.0,2012-06-28 12:00:00,Android Developer eMarkets and eCommerce Ber...,Permanent
4997,2833.33,2013-07-23 00:00:00,Aspire Data Recruitment,London,Finance,1.0,2013-04-24 00:00:00,SAS Senior Collections Recoveries Analyst,Permanent
4998,4791.67,2012-12-18 15:00:00,Annapurna HR Ltd,London,Information Technology,1.0,2012-11-18 15:00:00,Lead PHP Magento Developer London ****k,Permanent
4999,3541.67,2013-10-20 12:00:00,Parallel Consulting Limited,Surrey,Information Technology,1.0,2013-08-21 12:00:00,"Linux (CentOS), Puppet, SVN, LAMP , Systems Ad...",Permanent

### 2. Resolving schema conflicts
Give some general information about the conflicts you found in two schemas and steps you taken to resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: Naming conflict
No Id column so needed to add it by generating random Id(integer type) for each entry
Rename the 'closing' column to 'CloseDate', 'Opening' to 'OpenDate', 'Job Title' to 'Title', 'Organisation' to 'Company' and 'Type' to 'ContractType'

In [4]:
# Code to inspect data and identify conflicts in schema

# 2. Add an Id column with unique integer values starting from 1
df['Id'] = range(1, len(df) + 1)

# 3. Rename columns
rename_columns = {
    'Closing': 'CloseDate',
    'Opening': 'OpenDate',
    'Job Title': 'Title',
    'Organisation': 'Company',
    'Type': 'ContractTime'
}
df.rename(columns=rename_columns, inplace=True)

# 4. Convert the date columns to the desired format
df['CloseDate'] = pd.to_datetime(df['CloseDate']).dt.strftime('%Y%m%dT%H%M%S')
df['OpenDate'] = pd.to_datetime(df['OpenDate']).dt.strftime('%Y%m%dT%H%M%S')

# 5. Reorder columns to have 'Id' as the first column
df = df[['Id'] + [col for col in df if col != 'Id']]

# Display the first few rows (or save/export the modified dataset)
(df.head())

,Id,Monthly Payment,CloseDate,Company,Location,Category,Full-Time Equivalent (FTE),OpenDate,Title,ContractTime
0,1,1200.00,20121227T120000,Protocol Education,UK,Education,0.8,20121127T120000,Higher Level Teaching Assistant (HLTA),NaN
1,2,3125.00,20130825T150000,Cordius Ltd,UK,Information Technology,1.0,20130626T150000,Software Developers / Software Architects Not...,Permanent
2,3,4333.33,20130116T150000,Understanding Recruitment,Walton-On-Thames,Information Technology,1.0,20121018T150000,Senior BI Consultant (Cognos),Permanent
3,4,3750.00,20130213T150000,Wallace Hind Selection,UK,Sales,1.0,20121215T150000,"Technical Sales Manager, Pigments Fillers to S...",NaN
4,5,2916.67,20130112T120000,Greenhill Group Ltd,Eastern England,Sales,1.0,20121229T120000,Channel Account Manager Software,NaN

In [5]:
# 1. Calculate the Full-Time Annual Salary
df['Full-Time Annual Salary'] = df['Monthly Payment'] * 12

# 2. Calculate the Annual Salary based on the FTE value
df['Annual Salary'] = df['Full-Time Annual Salary'] * df['Full-Time Equivalent (FTE)']

# 3. Drop the 'Monthly Payment', 'Full-Time Equivalent (FTE)', and 'Full-Time Annual Salary' columns
df.drop(columns=['Monthly Payment', 'Full-Time Equivalent (FTE)', 'Full-Time Annual Salary'], inplace=True)

# Display the first few rows of the modified dataset
df

/var/folders/2_/c_6qd63x25l22xjb9435hbxw0000gn/T/ipykernel_3902/3796748656.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Full-Time Annual Salary'] = df['Monthly Payment'] * 12
/var/folders/2_/c_6qd63x25l22xjb9435hbxw0000gn/T/ipykernel_3902/3796748656.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Annual Salary'] = df['Full-Time Annual Salary'] * df['Full-Time Equivalent (FTE)']
/var/folders/2_/c_6qd63x25l22xjb9435hbxw0000gn/T/ipykernel_3902/3796748656.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns=['Monthly Payment', 'Full-Time Equivalent (FTE)', 'Full-Time Annual Salary'], inplace=True)

,Id,CloseDate,Company,Location,Category,OpenDate,Title,ContractTime,Annual Salary
0,1,20121227T120000,Protocol Education,UK,Education,20121127T120000,Higher Level Teaching Assistant (HLTA),NaN,11520.00
1,2,20130825T150000,Cordius Ltd,UK,Information Technology,20130626T150000,Software Developers / Software Architects Not...,Permanent,37500.00
2,3,20130116T150000,Understanding Recruitment,Walton-On-Thames,Information Technology,20121018T150000,Senior BI Consultant (Cognos),Permanent,51999.96
3,4,20130213T150000,Wallace Hind Selection,UK,Sales,20121215T150000,"Technical Sales Manager, Pigments Fillers to S...",NaN,45000.00
4,5,20130112T120000,Greenhill Group Ltd,Eastern England,Sales,20121229T120000,Channel Account Manager Software,NaN,35000.04
...,...,...,...,...,...,...,...,...,...
4995,4996,20130331T000000,Jonathan Lee Recruitment Ltd,London,Finance,20130130T000000,Head of Regulatory Policy,Permanent,69999.96
4996,4997,20120827T120000,Impact 360,Berkshire,Information Technology,20120628T120000,Android Developer eMarkets and eCommerce Ber...,Permanent,60000.00
4997,4998,20130723T000000,Aspire Data Recruitment,London,Finance,20130424T000000,SAS Senior Collections Recoveries Analyst,Permanent,33999.96
4998,4999,20121218T150000,Annapurna HR Ltd,London,Information Technology,20121118T150000,Lead PHP Magento Developer London ****k,Permanent,57500.04
4999,5000,20131020T120000,Parallel Consulting Limited,Surrey,Information Technology,20130821T120000,"Linux (CentOS), Puppet, SVN, LAMP , Systems Ad...",Permanent,42500.04

Tell me about how you fix the conflict here

In [16]:
# Code to fix the conflict
df['ContractTime'].value_counts
pd.pandas.unique(df['ContractTime'])

# Convert values in the 'ContractType' column as specified
df['ContractType'] = df['ContractTime'].replace({
    'Permanent': 'permanent',
    'Fixed Term Contract': 'contract'
}).fillna('non-specified')

# Display the first few rows of the modified dataset
df

,Id,CloseDate,Company,Location,Category,OpenDate,Title,ContractTime,Annual Salary,ContractType
0,1,20121227T120000,Protocol Education,UK,Education,20121127T120000,Higher Level Teaching Assistant (HLTA),NaN,11520.00,non-specified
1,2,20130825T150000,Cordius Ltd,UK,Information Technology,20130626T150000,Software Developers / Software Architects Not...,Permanent,37500.00,permanent
2,3,20130116T150000,Understanding Recruitment,Walton-On-Thames,Information Technology,20121018T150000,Senior BI Consultant (Cognos),Permanent,51999.96,permanent
3,4,20130213T150000,Wallace Hind Selection,UK,Sales,20121215T150000,"Technical Sales Manager, Pigments Fillers to S...",NaN,45000.00,non-specified
4,5,20130112T120000,Greenhill Group Ltd,Eastern England,Sales,20121229T120000,Channel Account Manager Software,NaN,35000.04,non-specified
...,...,...,...,...,...,...,...,...,...,...
4995,4996,20130331T000000,Jonathan Lee Recruitment Ltd,London,Finance,20130130T000000,Head of Regulatory Policy,Permanent,69999.96,permanent
4996,4997,20120827T120000,Impact 360,Berkshire,Information Technology,20120628T120000,Android Developer eMarkets and eCommerce Ber...,Permanent,60000.00,permanent
4997,4998,20130723T000000,Aspire Data Recruitment,London,Finance,20130424T000000,SAS Senior Collections Recoveries Analyst,Permanent,33999.96,permanent
4998,4999,20121218T150000,Annapurna HR Ltd,London,Information Technology,20121118T150000,Lead PHP Magento Developer London ****k,Permanent,57500.04,permanent
4999,5000,20131020T120000,Parallel Consulting Limited,Surrey,Information Technology,20130821T120000,"Linux (CentOS), Puppet, SVN, LAMP , Systems Ad...",Permanent,42500.04,permanent

In [17]:

# Convert values in the 'Category' column as specified
category_mapping = {
    'Information Technology': 'IT Jobs',
    'Health': 'Healthcare & Nursing Jobs',
    'Engineering': 'Engineering Jobs',
    'Finance': 'Accounting & Finance Jobs',
    'Sales': 'Sales Jobs',
    'Hospitality': 'Hospitality & Catering Jobs',
    'Education': 'Teaching Jobs',
    'Marketing': 'PR, Advertising & Marketing Jobs'
}

df['Category'] = df['Category'].replace(category_mapping)

# Display the first few rows of the modified dataset
df['Category'].value_counts()

Category
IT Jobs                             1317
Healthcare & Nursing Jobs            789
Engineering Jobs                     744
Accounting & Finance Jobs            668
Sales Jobs                           498
Hospitality & Catering Jobs          399
Teaching Jobs                        326
PR, Advertising & Marketing Jobs     259
Name: count, dtype: int64

#### Conflict 2: XXXX
......

### 3. Merging data

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

In [7]:
# Code to merge two data sets

### 4. Resolving data conflicts:
Give some general information about the data conflicts you found in the unified table and how you resolve them.

<span style="color: red"> You might have complex notebook structure in this section, please feel free to create your own notebook structure. </span>

#### Conflict 1: XXXX (e.g., complete duplications)
Here give some general information about this conflict.

In [8]:
# Code to inspect data and identify conflicts in data

Tell me about how you fix the conflict here

In [9]:
# Code to fix the conflict

......

#### Finding global key for the data
Find a proper global key for the integrated data and give justification here.

In [10]:
# Code to identify global key

.......

#### Conflict 2: XXXX (e.g., other duplications)
Here give some general information about this conflict.

### 5. Saving the integrated and reshaped data
The last part of the integration process is to export our output data to csv format, named as:
- '\<student\_id\>_dataset_integrated.csv'

In [11]:
# code to save output data

## Summary of the Assessment Task
Give a short summary and anything you would like to talk about this assessment task here.